- Data Storytelling 

- Story telling - making a story - because

Run any language, we needed an IDE

- https://sqliteonline.com/

-- query, database, table

In SQL every row is called a record. 

- Create a databases
- create tables
- query databases and tables
- create views, view a part of the database

1. Query a database 
    - can manipulate data within a database
    - create, or retrieve data from a database

2. CRUD operations on Records
    - Create 
    - Read
    - Update
    - Delete

In [3]:
SELECT * FROM Departments

SyntaxError: invalid syntax (2058289310.py, line 1)

In [ ]:
- SELECT - extract data from a database
- INSERT INTO 
- CREATE DATABASE
-

- Run SQL in a python based version, called SQLite

In [ ]:
```sql
CREATE TABLE Department(   -- create table -> create a new table   -- Specify name
  id      INT PRIMARY KEY,  -- created a new column, assigned INTEGER data type to it, -- added a constraint (rule or a property)
  name    VARCHAR(50)
)
```

- PRIMARY KEY columns, won't allow duplicates 
- VARCHAR - in sql is a data type - think of it like, string in python 
- You specify how many bytes to assign as well
-

In [ ]:

CREATE TABLE Department(
  id      INT PRIMARY KEY,
  name    VARCHAR(50)
);

CREATE TABLE Employees(
  id      INT PRIMARY KEY,
  name    VARCHAR(50),
  department_id INT,
  salary INT,
  city VARCHAR(50),
  hiring_year INT,
  FOREIGN KEY (department_id) REFERENCES departments(id)
);

SELECT name, id FROM Department;

-- insert some data into the tables
INSERT INTO Department (id, name) VALUES ( 1, 'Computer Science'),(2, 'Maths'),(3, 'Physics');

- In SQL case does not matter

- Spaces do not matter

- terminator is required ;

-

In [ ]:
#### Learning about selections

In [ ]:
-- selection 
-- WHERE clause 

-- let's us keep rows that meet certain conditions

SELECT * from Employees;

SELECT name, salary, city, hiring_year FROM Employees WHERE city = 'New York';

-- get the employees with salary greater that 80K 

SELECT name, salary, city, hiring_year 
FROM Employees 
WHERE salary > 60000 AND city = 'Chicago' AND hiring_year = 2018;

-- AND OR 

-- USing IN 
SELECT name, salary, city, hiring_year 
FROM employees
WHERE city IN ('New York', 'Chicago');

-- USing between 
SELECT name, salary, city, hiring_year 
FROM employees
WHERE salary BETWEEN 60000 AND 800000

#### Soring with order

In [ ]:
SELECT name, salary
FROM employees
ORDER BY salary ASC; -- (for acending)  -- DESC for decending

In [ ]:
-- selection 
-- WHERE clause 

-- let's us keep rows that meet certain conditions

SELECT * from Employees
LIMIT 3;


SELECT name, salary, city, hiring_year FROM Employees WHERE city = 'New York';

-- get the employees with salary greater that 80K 

SELECT name, salary, city, hiring_year 
FROM Employees 
WHERE salary > 60000 AND city = 'Chicago' AND hiring_year = 2018;

-- AND OR 

-- USing IN 


SELECT name, salary, city, hiring_year 
FROM employees
WHERE salary BETWEEN 60000 AND 800000
ORDER By hiring_year DESC; 


SELECT name, salary, city 
FROM Employees
ORDER BY city ASC, salary DESC
LIMIT 5;

SELECT name, salary, salary / 12 AS monthly_salary
FROM employees;

SELECT * FROM Employees;

-- UPDATE things using SQL 
-- UPDATE the table, with a new column

-- Add a new column to employees 

ALTER TABLE Employees
ADD COLUMN monthly_salary REAL;

UPDATE Employees 
SET monthly_salary = salary / 12

1. add a new column

2. modify a column - you can change the data type of column - ALTER TABLE tableName MODIFY COLUMN ColumnName datatype;

3. Rename a column - ALTER TABLE tableName RENAME COLUMN ColumnName to newColumnName;

4. Drop, delete a column - ALTER TABLE tableName DROP COLUMN ColumnName;

5. Rename the table - ALTER TABLE tableName RENAME TO newTableName;

1. Write a SQL statement to create the employees table with the columns:

    - emp_id (integer, primary key)

    - name (text, not null)

    - department (text, not null)

    - salary (integer)

    - city (text)

2. Write INSERT statements to add at least 5 employees into the employees table with different departments, salaries, and cities.

3. Write a query to show all columns for all employees in the table.

4. Write a query to show only the name and salary of all employees.

5. Write a query to show all employees who work in the **Engineering** department.

6. Write a query to show all employees whose salary is greater than 50,000.

7. Write a query to show all employees who live in the city Mumbai.

8. Write a query to list all employees ordered by salary from highest to lowest.

9. Write a query to list all employees ordered by name in A–Z order.

10. Write a query to show the name, salary, and a calculated column called monthly_salary which is salary / 12.

11. Write an ALTER TABLE statement to add a new column called monthly_salary to the employees table.

12. Write an UPDATE statement to fill the monthly_salary column for all employees so that:
monthly_salary = salary / 12.

13. Add another calculated column, salary_next_year, such that, the current salary has been increased by 9%
    - Salary + 0.09 * Salary = salary_next_year


After updating, write a query to show name, salary, and monthly_salary for all employees to verify the update.

In [ ]:
#1. Write a SQL statement to create the employees table with the columns:

   # - emp_id (integer, primary key)

    #- name (text, not null)

   # - department (text, not null)

    #- salary (integer)

   # - city (text)

In [ ]:

#1️⃣ Drop & Create
DROP TABLE IF EXISTS employees;

CREATE TABLE employees (
    emp_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    department TEXT NOT NULL,
    salary INTEGER,
    city TEXT
);

In [ ]:
#2. Write INSERT statements to add at least 5 employees into the employees table with different departments, salaries, and cities.
# Insert data
INSERT INTO employees (emp_id, name, department, salary, city)
VALUES
(1, 'Ali', 'Engineering', 60000, 'Mumbai'),
(2, 'Siti', 'HR', 45000, 'Delhi'),
(3, 'Ahmad', 'Engineering', 75000, 'Bangalore'),
(4, 'Aina', 'Finance', 55000, 'Mumbai'),
(5, 'Ravi', 'Marketing', 50000, 'Chennai');

In [ ]:
#3. Write a query to show all columns for all employees in the table.
SELECT * FROM employees;

In [ ]:
#4. Write a query to show only the name and salary of all employees.
SELECT name, salary
FROM employees;

In [ ]:
#5. Write a query to show all employees who work in the **Engineering** department.
SELECT *
FROM employees
WHERE department = 'Engineering';

In [ ]:
#6. Write a query to show all employees whose salary is greater than 50,000.
SELECT *
FROM employees
WHERE salary > 50000;

In [ ]:
#7. Write a query to show all employees who live in the city Mumbai.
SELECT *
FROM employees
WHERE city = 'Mumbai';

In [ ]:
#8. Write a query to list all employees ordered by salary from highest to lowest.

SELECT *
FROM employees
ORDER BY salary DESC;

In [ ]:
#9. Write a query to list all employees ordered by name in A–Z order.
SELECT *
FROM employees
ORDER BY name ASC;

In [ ]:
#10. Write a query to show the name, salary, and a calculated column called monthly_salary which is salary / 12.
SELECT
    name,
    salary,
    salary / 12 AS monthly_salary
FROM employees;

In [ ]:
#11. Write an ALTER TABLE statement to add a new column called monthly_salary to the employees table.
ALTER TABLE employees
ADD COLUMN monthly_salary INTEGER;

In [ ]:
#12. Write an UPDATE statement to fill the monthly_salary column for all employees so that:
#monthly_salary = salary / 12.
UPDATE employees
SET monthly_salary = salary / 12;

In [ ]:
#13. Add another calculated column, salary_next_year, such that, the current salary has been increased by 9%
    #- Salary + 0.09 * Salary = salary_next_year
# a) add column
ALTER TABLE employees
ADD COLUMN salary_next_year INTEGER;

In [ ]:
#b) Update salary_next_year
UPDATE employees
SET salary_next_year = salary + (salary * 0.09);

In [ ]:
#final verify
SELECT
    name,
    salary,
    monthly_salary,
    salary_next_year
FROM employees;

# PRAGMA table_info() → check structure
# ALTER TABLE → tambah column
# AS → column sementara
# UPDATE → isi data column baru

In [4]:
import sqlite3 as sql

In [5]:
# connect to a database
# there is no database, when we create a connection, automaticaly create it

connection = sql.connect('test.db')

# we need a cursor object: to point to record in the database - move through th db
cursor = connection.cursor()

In [ ]:
cursor.execute('''
               
CREATE TABLE students(
    id INT PRIMARY KEY,
    name VARCHAR(10),
    city VARCHAR(10),
    hobby VARCHAR(10)
)
               
''')

In [7]:
# commit the changes and close the connection
connection.commit()

In [8]:
cursor.execute("INSERT INTO students (id,name,city,hobby) VALUES (2,'Izam','Johor','Playing Chess')") 
cursor.execute("INSERT INTO students (id,name,city,hobby) VALUES (3,'Hazirah','Seremban','Playing Computer Games')")
cursor.execute("INSERT INTO students (id,name,city,hobby) VALUES (4,'Kimi','Penang','Playing Football')") 
cursor.execute("INSERT INTO students (id,name,city,hobby) VALUES (5,'Jeff','Melaka','Reading Bookss')")

In [10]:
cursor.execute("SELECT * FROM students")
cursor.fetchall()

[(1, 'Amir', 'Seremban', 'Playong Computer Games'),
 (2, 'Izam', 'Johor', 'Playing Chess'),
 (3, 'Hazirah', 'Seremban', 'Playing Computer Games'),
 (4, 'Kimi', 'Penang', 'Playing Football'),
 (5, 'Jeff', 'Melaka', 'Reading Bookss')]